IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedGeneral(IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed,IdeaRS.OpenModel.Geometry2D.Region2D,System.Double,System.Double)
Fill center line for general cold formed css
gcf:
region2D: We need PolyLine2D from region2D
Thickness: Thickness
InsideRadius: Inside radius